---
kind: other
id: Methods.T:Autodesk.Revit.Exceptions.ArgumentException
source: html/03380b22-26d1-f947-300d-d1f640c8e1bb.htm
---
# ArgumentException Methods

Retrieves data needed to serialize the target object.